//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	TCG.UNI
//
// Description:	TCG Form String Definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
#string STR_TCG_FORM 		            #language eng "Trusted Computing"
#string STR_TCG_FORM_HELP 	            #language eng "Trusted Computing Settings"

#string STR_TPM_PROMPT 	                #language eng "  TPM State"
#string STR_TCM_PROMPT 	                #language eng "  TCM State"
#string STR_TPM_SUPPORT_PROMPT 	        #language eng "  Security Device Support"
#string STR_TCM_SUPPORT_PROMPT 	        #language eng "  Security Device Support"
#string STR_TPM_PASS_PROMPT             #language eng "  Pwd Authentication"

#string STR_TPM_HELP   	                #language eng "Enable/Disable Security Device. NOTE: Your Computer will reboot during restart in order to change State of the Device."

#string STR_TPM_CLEAR 	                #language eng "TPM Clear"
#string STR_TCM_CLEAR 	                #language eng "TCM Clear"
#string STR_TPM_NONE 	                #language eng "None"
#string STR_TPM_OWNER 	                #language eng "Enable Take Ownership"
#string STR_TPM_NOOWNER 	            #language eng "Disable Take Ownership"
#string STR_TPM_ENABLE 	                #language eng "Enable"
#string STR_TPM_DISABLE	                #language eng "Disable"
#string STR_TPM_ENABLED	                #language eng "Enabled"
#string STR_TPM_DISABLED                #language eng "Disabled"
#string STR_TPMOP_PROMPT 	            #language eng "Pending operation"
#string STR_TPM_CONFIGURATION			#language eng "Configuration"
#string STR_TPM_SETUP_ERROR             #language eng "Error reported while executing a setup request"   
#string STR_TPM_STATUS_INFO				#language eng "Current Status Information"
#string STR_ENABLED_PROMPT	 	        #language eng "  TPM Enabled Status:"
#string STR_TCM_ENABLED_PROMPT	        #language eng "  TCM Enabled Status:"
#string STR_ACTIVATE_PROMPT 	        #language eng "  TPM Active Status:"
#string STR_TCM_ACTIVATE_PROMPT         #language eng "  TCM Active Status:"
#string STR_ONOFFSTATE_HELP				#language eng "Provides the current Capability state of the security device"
#string STR_TPMDISABLED					#language eng "Disabled"
#string STR_TPMACTIVATED				#language eng "Activated"
#string STR_TPMDEACTIVATED				#language eng "Deactivated"
#string STR_TPMENABLED					#language eng "Enabled"
#string STR_OWNED_OR_UNOWNED_PROMPT		#language eng "  TPM Owner Status:"
#string STR_TCM_OWNED_OR_UNOWNED_PROMPT		#language eng "  TCM Owner Status:"
#string STR_OWNED_OR_UNOWNED_HELP		#language eng "Provides current Ownership state. ie: Owned or Unowned"
#string STR_OWNED						#language eng "Owned"
#string STR_UNOWNED						#language eng "Unowned"
#string STR_TPMOP_HELP  	            #language eng "Schedule an Operation for the Security Device. NOTE: Your Computer will reboot during restart in order to change State of Security Device."
#string STR_TPMSUPPORT_HELP  	        #language eng "Enables or Disables BIOS support for security device. O.S. will not show Security Device. TCG EFI protocol and INT1A interface will not be available."
#string STR_EMPTY						#language eng 	""
#string STR_TPMHARDWARE					#language eng 	"  NO Security Device Found"
#string STR_TPMSUPP						#language eng 	"  SUPPORT TURNED OFF"
#string STR_TPMOPTIMIZE					#language eng 	"  Reset Required"
#string STR_TPM_PASS_HELP               #language eng "Determines whether state change of security device requires Password Authentication"
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
